Repository: henyee/NBDYSJCT
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 而酒鬼花生的炒制方法非常简单，至少在现在的麦格看来，是极其简单容易上手的一道菜了。
en_us: Furthermore, the frying method of the drunkard peanuts was very simple; at least the current Mag found it very easy to learn the dish.

source: 而酒鬼花生，更是其中的佼佼者，如同专门为酒鬼定制的一般，在下酒菜的江湖之中杀出了一席之位。
en_us: And that drunkard peanuts were the best among peanuts, as if having been custom-made for drunkards. They cemented their status among the dishes to go along with alcoholic drinks.

source: 而除了乔修之外，如何颠覆爱德华家族对于洛斯帝国的统治，也成为了麦格这些日子思考的问题。
en_us: Besides, other than finding Josh, how to topple the Edward Family's rule in the Roth Empire was also a problem that Mag had been thinking about recently.

source: 而随着热量的炙烤，烤羊肉串和烤牛肉串上开始冒油，香味也是随之散发开来，酱汁一刷，更是全场响起了吞咽口水的声音。
en_us: The beef kebabs and the mutton kebabs began to sizzle as they were grilled, and their aroma began to spread. After brushing on the sauce, everyone present made a gulping sound.

source: 而随着食全食美杂志的热卖，他的信仰粉丝人数呈爆炸式增长，目前已经突破了十八万。
en_us: With the excellent sale of "Perfect Food", the number of his religious fans grew exponentially. It had already broken through 180,000 currently.

source: 而食用这种食材的方法来自一位名为‘麦格’的厨师，而贩卖克苏鲁的躯体的那家店铺也似乎和他有关。关切！
en_us: The method for eating this ingredient originated from a chef known as "Mag". The shop selling Cthulhu's body seemed to be related to him too. Take note!

source: 而高阶文明的存在，并且可能已经发现他的存在，更是让他觉得头疼。
en_us: The existence of an advanced civilization, and the fact that they might have already found out about him, caused him even more worries.

source: 而麦格也已经关了火，稍等了一会，端起三屉包子从厨房里出来。
en_us: Mag had already switched the fire off and after a while, he brought the three bamboo steamers of dumplings out of the kitchen.

source: 而麦格他们一家则随着一阵金光消失。
en_us: Meanwhile, Mag and his family disppeared after a flash of golden light.

source: 而麦格则笑着告知茅台将参加品酒大会，至于为何威士忌没有参加，那是给其他酒一个机会。
en_us: Mag smiled and replied that the maotai would be attending the liquor tasting event and as for why the whiskey did not attend, it was to give the other alcohols a chance.

source: 而麦格自己更全程极为淡定的领回了金奖奖杯，仿佛早有预料一般。
en_us: Meanwhile, Mag calmly accepted his gold award trophy, as if he had anticipated it.

source: 而麦米餐厅的出现，就像一道光出现在卡诺的世界，让他有了留下来的充足理由。
en_us: And the appearance of Mamy Restaurant was just like a ray of light in Canault's world. It gave him ample reason to stay.

source: 而黑袍人则有些仓皇的逃离，冲入火堆之中，消失无踪。
en_us: The man in a black robe escaped in a hurry, darting into the fire, and disappearing out of sight.

source: 联盟一旦成立，为了这场战争，各族不可避免的需要进行更加深入的合作。
en_us: Once the alliance is formed, the various races would have to have an in-depth cooperation with each other for this battle.

source: 联系起前两日几位兵部大员被灭门的惨案，一时间朝廷大臣人人自危，普通人也是颇为惶恐。
en_us: Together with the massacres of the few Ministry of Defense's courtiers in the past two days, all the courtiers began to fear for their lives. Even the ordinary folks were terrified.

source: 肖恩一派的大臣此时眼中都闪着喜悦和兴奋的光芒，原本势均力敌的局面，因为乔修的一番愚蠢行径，让肖恩轻易胜出。
en_us: The courtiers in Sean's faction had a glint of joy and excitement in their eyes. Sean won easily, despite being evenly matched with his rival initially, due to Josh's stupid behavior.

source: 肖恩咧嘴一笑，道：“只要这消息已经传开，在便是事实了，乔修从今日开始，已经死了。”
en_us: Sean smiled, and said, "This news has already become a fact now that it has spread. Josh is already dead from today on."

source: 肖恩在他的必杀之列，安德烈是否有继承人他并不在意。
en_us: Sean was in his to-kill list and Mag did not care if Andre had anyone to succeed him.

source: 能在洛都城里找到这样一个偏僻的地方，对方显然不是第一天打这种主意了。
en_us: To be able to find such a desserted place in Rodu showed that this was not the first day the other party had thought of it.

source: 能够嫁给这样一位温柔体贴，还会做如此美味的食物的男人，实在太让人羡慕了。
en_us: She could amrry such a gentle and meticulous man who was so good at cooking. How envious.

source: 能够容纳数千人的大教堂很快便被坐满，后排还站了不少人。
en_us: The church that could accommodate a few thousand people was quickly filled up. There were even many people standing at the back.

source: 能够把麦米餐厅做成混乱之城第一餐厅，收获无数忠实顾客，每日排队爆满，麦格的营销手段肯定不止于此。
en_us: Mag's marketing strategy would not only stop at that if he could make Mamy Restaurant the top restaurant in Chaos City and rake in all the loyal customers to make the restaurant a full house every day.

source: 能够离开这冰冷的雪原，回到满大街漂亮小姐姐的大都市，还能吃上一顿热乎乎的美食，大概没有比这更幸福的事情了。
en_us: There was probably nothing better than to be able to leave that icy plain and return to the large city full of beautiful ladies on the street, and be able to even have a piping hot meal.

source: 脸已经肿起来，有些生疼，脸上还挂着几片猪耳朵，红油顺着脸颊流入脖子，滴落在官袍上，可他却不敢伸手擦拭一下。
en_us: Aulden's face had already become swollen, and it was beginning to hurt. He even had a few pieces of pig's ears hanging on his face. The red oil trickled down his face to his neck, dripping on his official suit, but he did not dare to wipe it away.

source: 自从上次在洛都见到教皇，艾米被赠与了那双隐形的翅膀之后，麦格花时间收集了不少和教廷有关的资料。
en_us: Ever since they had met the pope at Rodu, and Amy had been given that pair of invisible wings, Mag had spent quite some time collecting information related to the Holy See.

source: 自从看透了哈迪斯先生的格局之后，他对于哈迪斯先生的敬佩之情，如那滔滔江水奔流不息。
en_us: Ever since he had understood Mr. Hades' plans, his admiration for Mr. Hades was boundless.

source: 自从被革职回到领地，感受到正在风之森林肆虐的自由风气，艾略特将封地封锁，眼镜一切消息在奴隶和仆从之间传播。
en_us: Ever since he was removed from his position, returned to his fiefdom and felt the sense of freedom that was raging through the Wind Forest, Elliot locked down his fiefdom and stopped any information from spreading between the slaves and the servants.

source: 自己虽然是法部的三把手，可在这位公爵大人面前，这点官位又算什么。
en_us: Although he was a high-ranking official, it was nothing at all in front of this duke.

source: 自由的风气，在风之森林渐渐弥漫开来。
en_us: The ethos of freedom started spreading in the Wind Forest.

source: 至于为何如此热情的帮助埃菲，其实也只是生意一场而已。
en_us: As for why he was helping Eiffie so enthusiasically, it was all business.

source: 至于哈迪斯先前所说的那个商业计划，比起现在罗莫街普遍高出数倍的租金，完全是天马行空般的想法。
en_us: As for the business plan that Mr. Hades mentioned earlier, the rental rate that was several times higher than the current Romo Street's rental rate, was an absurb idea.

source: 至于在店饮用，是为了防止一些不法黄牛将酒转手倒卖，以及避免假酒泛滥。”
en_us: As for restricting the consuming in the tavern, it was to prevent the scalpers from bringing the liquor out and selling them outside, and to prevent the prevalence of fake liquor."

source: 至于她是否真的比他更强大，来到洛都之后，他已经听说了她在魔法师大会上战胜八级魔法师夺得大会冠军的消息。
en_us: As for whether she was indeed more powerful than Noah, the latter had already heard about how she had won the championship at the Magic Caster Tournament by defeating an 8th-tier magic caster after coming to Rodu.

source: 至于所谓的教皇。
en_us: As for the so-called pontiff.

source: 至于更高的文明，这个尚有种族没有脱离茹毛饮血的习惯的世界，麦格怎么也不相信存在比系统更高等级的文明。
en_us: As for an even more advanced civilization, Mag would never believe in the existence of a being from an even more advanced civilization than the System in this world where the various races had yet to break out of their habit of eating raw food.

source: 至于看上埃菲这种事情？
en_us: As for being interested in Eiffie?

source: 至于红烧肉，这的确是一道简单快手的好菜啊。
en_us: As for the red braised pork, this was indeed a nice dish that was quick and easy to cook.

source: 至于艾伊酒馆这种小清新的名字，在洛都这种危险的地方，还是尽量不要让人有联想的机会。
en_us: As for a refreshing name like Ayi Tavern, it was best not to give people any chances to make a connection in such a dangerous place like Rodu.

source: 至于茅台酒和威士忌的酿酒厂，等汉娜的朗姆酒工厂顺利运行，进入量产阶段后，麦格打算还是交给她来做。
en_us: As for the Maotai and whiskey brewery, Mag had intended to hand it over to Hannah after her rum factory successfully started operating, and was in the production phase.

source: 至于评分标准，每位评委十分制，根据五位品酒师的主观感受来决定。
en_us: As for the judging criteria, every judge had 10 points to give and they were based on the subjective opinions of the five sommelier judges.

source: 至于这场战斗的结果，只能等明天伊琳娜醒来再问她了。
en_us: As for the result of this battle, he had to wait till tomorrow morning to ask Irina after she woke up.

source: 至于那三皇子，一个喜欢干木匠活的小屁孩，根本不在安德烈的考虑之列。
en_us: The Third Prince was just a child who liked carpentry and was not within Andre's consideration.

source: 至于那点烫嘴的感觉，已经完全被美味所压制。
en_us: As for the scald, it was completely suppressed by the deliciousness.

source: 至于那神秘擀面杖。
en_us: As for that mysterious roller pin.

source: 至于麦老板的实力，他爷爷自认为没有把握能打得过他。
en_us: As for Boss Mag, his grandpa said that he had no confidence in defeating Boss Mag.

source: 至少对方没有直接上来就是一通歧视言论，然后拿出手铐让他束手就擒，表明这件事还有的谈。
en_us: At least, the other party didn't just come to him with a discrimination speech, take out a pair of cuffs and then force him into submission. This meant that there were room for a discussion.

source: 舌头经历了一番疯狂，却依旧没有得到满足挨。
en_us: Her tongue had experienced the wildness but it was still unsatisfied.

source: 舒适的温度，又有花草，各种小虫小兽自然不会少。
en_us: A comfortable temperature coupled with flowers and plants, naturally there would be plenty of insects and little animals.

source: 舔狗系统：对嘛，姿势要到位，要求全满足，舔到最后应有尽有！
en_us: Bootlicker System: Exactly, do it right, satisfy all needs and you'll have everything you want!

source: 舱门打开，晞走了出来，先看了一眼被斩了两个脑袋，并且陷入晕厥中的三头大蛇，目光微凝，然后看向了坐在狮鹫背上的麦格。
en_us: The spaceship's door opened and Xi walked out. She flicked a glance at the three-headed snake that had two of its heads cut off and narrowed her eyes. Then, she looked at Mag on the griffin's back.

source: 色泽金黄晶亮的酒液，在杯中微微晃动，如宝石般璀璨。
en_us: The color was a beautiful gold and the liquid swirled in the glass, sparkling like a gem.

source: 艹！
en_us: F*ck!

source: 艾略特打了个哈欠，转身又进了卧室。
en_us: Elliot yawned and returned to his bedroom.

source: 艾略特气得从地堡里跳了出来，抬手就是一巴掌，看着那年轻的精灵道：“你一个人去追吗？”
en_us: Elliot jumped out from the bunker angrily and slapped that young elf before saying, "Are you going after them alone?"

source: 艾略特的脑袋越来越低，直到埋到土里，身体在微微颤抖。
en_us: Elliot's head hung lower and lower until it was buried in the ground. His body was shaking.

source: 艾略特看完信之后，差点把信封都吃了。
en_us: Elliot almost ate that letter after reading it.

source: 艾略特脸色大变，膝盖一软，便跪在了地上，颤抖着道：“大祭司，我对精灵族绝对忠心，我只是担心精灵被毁灭才会出此下策，但我真的是全心全意为精灵族在考虑啊。”
en_us: Elliot's face changed immediately. He felt his legs go jelly, and he dropped to his knees, shivering as he said, "High Priestess. I am absolutely loyal to the elves. I only suggested that because I was worried that the elves would be wiped out. I am really thinking for the elves wholeheartedly."

source: 艾略特连忙道：“大祭司，我们还是赶紧派出护卫队把他们全部抓起来吧，事情再闹大，可就不好收场了，整个风之森林的根基都会被动摇，这些人可真是糊涂了。”
en_us: Elliot quickly said, "High Priestess, we should quickly deploy guards to arrest all of them. If things got even bigger, it would be difficult to clean up the mess. The foundation of the entire Wind Forest would be challenged. These people are so foolish."

source: 艾米一把抱住了准备撤退的丑小鸭，然后捏着他的圆脸，从勺子里捏了几颗炒饭丢进了它的嘴里。
en_us: Amy grabbed hold of Ugly Duckling, who was about to retreat. She then pinched its round face and threw a few grains of fried rice into its mouth.

source: 艾米一脸无辜的耸了耸小肩膀，“您说小朋友要诚实的。”
en_us: Amy shrugged with an innocent expression. "You said children have to be truthful."

source: 艾米一脸认真的摇摇头，摆手拒绝道：“你看起来一点都不好耍。”
en_us: Amy shook her head seriously, and waved her hands as she said, "You don't look fun to kid."

source: 艾米一脸认真的说道：“这是话梅糖哦，酸酸甜甜的，超好吃的，你肯定没有吃过。”
en_us: "This is a preserved plum candy. It's sour and sweet. It's super delicious. You definitely have to try it," Amy said with a serious expression.

source: 艾米一脸认真道：“父亲大人说，就算是漂亮姐姐送的东西也不能随便要，女孩子在外面要保护好自己。”
en_us: Amy seriously replied, "Father said I can't accept favors when I'm out, even if they are from a beautiful big sister. Girls have to protect themselves when they are out by themselves."

source: 艾米上楼叫她妈下来吃饭。
en_us: Amy went up to get her mom down for breakfast.

source: 艾米专心致志的咕噜咕噜喝完了一碗粥，趁着麦格帮她盛粥的间隙，好奇的问道：“父亲大人，我们的酒馆什么时候开业呢？我还没有见到一个客人呢。”
en_us: Amy concentrated on finishing her bowl of porridge, and while Mag was giving her a second serving, she asked curiously, "Father, when is our tavern opening for business? I haven't seen a single customer."

source: 艾米丢出了手里的那颗绿豆，圆滚滚的绿豆在地板上滚了出去，发出了一串声音。
en_us: Amy threw out the mung bean in her hand, and the round bean rolled around on the floor.

source: 艾米也注意到了这只蜗牛，小跑着过来蹲下。
en_us: Amy noticed that snail too. She jogged over and squatted down.

source: 艾米从刀架上选了一把父亲常用的菜刀，爬上小板凳，小手抓过一块火腿，然后一刀劈下。
en_us: Amy took the cleaver her father used often from the knife rack. She climbed onto her small stool, grabbed a piece of ham, and hacked it.

source: 艾米从床上爬起来，把房间里里外外的都找了一遍，嘟着小嘴有些生气道：“你再不出来的话，我就要告诉父亲大人了，把你这个坏东西抓出来。”
en_us: Amy crawled up from her bed. She searched the room inside out, and pouted angrily as she said, "If you're not coming out, I'll tell Father to catch you.

source: 艾米伸手捏起一截油条，放到嘴边小口呼呼吹着气，然后直接咬了一口。
en_us: Amy reached out to take one youtiao. She placed it near her mouth, and blew on it gently before giving it a big bite.

source: 艾米做的这份灵魂炒饭，尽得她的真传。
en_us: This soul fried rice made by Amy indeed had the essence of her cooking.

source: 艾米停下脚步，回头看着麦格道：“父亲大人，肚子饿了呢，今天中午我们吃什么好吃的？”
en_us: Amy halted her footsteps, and turned to say to Mag, "Father, I'm hungry. What are we eating today?"

source: 艾米单手提着椅子，奶声奶气的说道。
en_us: Amy said as she lifted a chair in one hand.

source: 艾米单手领着小折叠椅，看着那巨汉奶声奶气的说道。
en_us: Amy held onto that little folding chair and said to that big guy childishly.

source: 艾米可以客串收银和点单的工作，安妮也能帮忙上上菜，伊琳娜他就不敢指望了，但身兼数职的他，还是感觉太忙碌了。
en_us: Amy could be the cashier and take orders and Annie could help to serve, but he didn't dare to depend on Irina. He, who had taken on multiple roles, felt way too busy.

source: 艾米吃包子的动作一顿，抬头看着麦格。
en_us: Amy paused and look at Mag.

source: 艾米吃饱了到一旁逗丑小鸭玩，安妮却没有急着上楼画画，在麦格对面坐了下来。
en_us: After eating her fill, Amy started playing with Ugly Duckling. Annie did not go up to draw. Instead, she sat in front of Mag.

source: 艾米和安妮玩了许多游戏，最后在一条小吃街前停下，回头看着麦格问道：“这里好好玩啊，不过现在肚子有点饿了，我们去哪里吃午饭呢？”
en_us: Amy and Annie played a lot of games before stopping in front of a snack street. They turned around to ask Mag, "It's so fun here, but I'm a little hungry now, so where do we go for lunch?"

source: 艾米回头，看着埃菲恍然道：“是你啊，漂亮姐姐。”
en_us: Amy turned back and said with realization when she saw Eiffie, "It's you, pretty big sister."

source: 艾米大受鼓舞，从碗柜里拿出碗，一边道：“父亲大人和母亲大人都喜欢的话，那我给你们盛哦。”
en_us: Amy was greatly encouraged. As she took the bowls out from the cabinet, she said, "Since Father and Mother like it, let me get you two some."

source: 艾米夹起一块黄瓜。
en_us: Amy took a piece of cucumber.

source: 艾米学着麦格的样子夹了一颗田螺放到嘴里，向糖一样含了一会，差不多没味了才吐出来，一脸疑惑的看着麦格：“父亲大人，吃这个蜗牛就是舔一舔吗？”
en_us: Amy copied Mag and put a escargot in her mouth. She sucke don it for a while like a sweet and almost spat it out. She looked at Mag with bewilderment and asked, "Father, do you just lick this snail?"

source: 艾米就蹲在一旁观察了好一会，然后若有所思的点了点头：“没毒。”
en_us: Amy squatted at the side to observe Ugly Duckling for a long while. After that, she nodded thoughtfully, and said, "It's not poisonous."

source: 艾米左右看了一遍，问道：“我的零食呢？”
en_us: Amy looked around her before asking, "Where's my snacks?"

source: 艾米往嘴里丢了一颗爆米花，嚼出了清脆的声音。
en_us: Amy threw a popcorn into her mouth, and it crunched loudly.

source: 艾米手一抖，还剩下的半瓶可乐向着地下掉去。
en_us: Amy's hand trembled and dropped the bottle, together with the remaining half of the drink.

source: 艾米手臂那么粗的大虾，上等的云母鸡蛋，腌制多年的上等火腿，新鲜的珍惜树菇……
en_us: There were prawns the size of Amy's arms, top-grade egg, top-grade ham that had been marinated for years, fresh and rare tree mushroom…

source: 艾米打开盒子，里边装满了各种换了本土包装的零食。
en_us: Amy opened the box and saw that there were many local snacks in it.

source: 艾米把丑小鸭抱在怀里，走进了早餐店。
en_us: Amy carried Ugly Duckling in her arms and walked into the breakfast shop.

source: 艾米把浅盘里的汤汁吸溜喝光，却没有挪脚，而是抬起头不解的看着麦格：“可是……您刚刚不是说后院的蜗牛肯定不能吃吗？”
en_us: Amy slurped up all the soup in the plate, but she didn't move. Instead, she looked at Mag perplexedly. "But...didn't you just say that the snails in the back yard are definitely not edible?"

source: 艾米抬头看着麦格，小声道：“我好久没有见以前的小伙伴了呢，杰西卡说露娜老师给他们准备了很多吃的，而且也有了住的地方，我想去看看他们，你可以给他们做一点好吃的东西吗？”
en_us: Amy looked up at Mag, and whispered, "I haven't seen my friends for a long time. Jessica said that Teacher Luna had prepared a lot of delicious food for them, and they also had a place to stay now. I would like to visit them. Can you make some scrumptious food for them, please?"

source: 艾米拆开大礼包，箱子里有乐事薯片、咪咪虾条、卫龙辣条、麦丽素、可口可乐……
en_us: Amy opened the gift package. In the box were Lays chips, Mimi prawn snacks, Weilong spicy strips, Maltesers, Coca-cola...

source: 艾米拒绝了埃菲的帮助，把老板递来的一大包早餐抱在怀里，和埃菲一起出了早餐店。
en_us: Amy rejected Eiffie's help. She carried the bag of breakfast in her arms and left the breakfast shop with Eiffie.

source: 艾米拿起一块黄瓜蘸了蘸，然后喂到嘴里。
en_us: Amy picked up a piece of cucumber and dipped it in the sauce before putting it in her mouth.

source: 艾米提着折叠椅，也跟着从二楼直接跳了下去。
en_us: Amy held onto the folding chair and jumped down from the second floor too.

source: 艾米握着小折叠椅，一本正经的说道。
en_us: Amy held onto a little folding chair and said prim and properly.

source: 艾米搬了个小板凳，自己从锅里拿了一只灌汤包，然后坐在麦格面前，一边小口吃着包子，一边问道。
en_us: Amy carried a stool over and took a soup dumpling out from the pot. After that, she sat in front of Mag, eating her soup dumpling while she asked.

source: 艾米摇头拒绝道：“不行，父亲大人说要勇于接受挑战，我要选彩虹炒饭！”
en_us: Amy shook her head, and said, "No, Father said that we should always take on challenges. I choose to make the rainbow fried rice!"

source: 艾米收起属性面板，然后笑眯眯的问道。
en_us: Amy closed the interface, and asked smilingly, "System, are you there?"

source: 艾米放下勺子，捏了捏丑小鸭的肥脸，一脸开心道：“死了吗？那太可惜了，看来今天中午只能吃北京烤鸭了，或者是烧鹅呢？”
en_us: Amy put down the sppon, pinched Ugly Duckling's face and happily said, "Are you dead? What a pity. Seems like we can only have either Peking Duck or roast goose for lunch today?"

source: 艾米放下瓶子，打了一个长长的嗝，然后冲着麦格露出了一个灿烂的笑容，“真的有变快乐呢。”
en_us: Amy placed the bottle down and burped loudly. After that, she smiled radiantly at Mag and said, "I really became happier."

source: 艾米放到嘴里咬了一口，眉头一皱，重新打量着手里多了两个牙印的田螺，摇摇头道：“不好吃。”
en_us: Amy put it to her mouth and bit on it. She frowned and looked at the escargot with two teethprints as she shook her head and said, "This is not nice."

source: 艾米最终还是放过了飞镖摊位的老板，倒不是因为游戏难度过大，而是因为那所谓的精美礼品对她毫无吸引力，要是精美礼品换成大肥鹅的话，估计结果就不一样了。
en_us: Amy eventually let the boss of the darts stall off. It wasn't because the game was too difficult, but because the so-called exquisite prizes were not attractive to Amy. The result would have been different if the prizes had been switched to geese.

source: 艾米止住了难过，点开了那属性鉴定技能。
en_us: Amy stopped feeling sad, and clicked open that ability of 'Attribute Identification'.

source: 艾米用勺子舀起一只抄手，红亮的汤汁给面皮染上了漂亮的颜色，肉香透过薄薄的皮徐徐飘来，几点葱花和香菜点缀其上，看起来极为诱人。
en_us: Amy picked up one wonton with the spoon. The bright red soup gave the wonton's skin a beautiful color. The meat's aroma slowly drifted over through the thin dough skin. Spring onions and cilantro were scattered over it, making it look very enticing.

source: 艾米用小手托起下巴，歪头，然后可怜兮兮道：“胖爷爷，小艾三天没有吃饭了，可以给我一点钱钱买面包吃吗？”
en_us: Amy propped her chin upon her hands, tilted her head, and said, "Fat Grandpa, Ay hasn't eaten for three days, can you give me some monnies to buy some bread?"

source: 艾米的声音一下止住。
en_us: Amy's voice halted immediately.

source: 艾米的小短腿踹了几脚空气后，歪头看着麦格央求道：“父亲大人，帮我踹一下脚踢。”
en_us: After Amy's short leg kicked a few times in the air, she tilted her head and pleaded with Mag, "Father, help me kick this."

source: 艾米的生活体验系统，也在同时发布了任务奖励和新的任务。
en_us: Amy's Life Experience System released the mission reward and a new mission at the same time.

source: 艾米的目光很快盯上了安妮，眼睛一亮道：“那就让安妮姐姐坐我的车吧，这样等我要停车的时候，就可以用她的大长腿把车子稳住了。”
en_us: Amy's gaze quickly moved to Annie. Her eyes lit up and said, "In that case, Big Sister Annie can take my ride. That way, when I want to stop, she can use her long leg to stabilize the ride."

source: 艾米的眼睛完全亮了起来，欢快的嚼着。
en_us: Amy's eyes lit up as she chewed happily.

source: 艾米的脑海中出现了一行鉴定报告。
en_us: A row of valdiation report appeared in Amy's mind.

source: 艾米的腮帮子鼓鼓的，湛蓝色的眼睛一亮，眼睛跟着眨巴眨巴着，有些惊喜道：“冰冰凉凉的，清爽可口，好好吃哦。”
en_us: Amy's cheeks were puffed out, and her blue eyes lit up. She blinked her eyes in surprise, and said, "It's cool and icy. Very refreshing, very delicious."

source: 艾米的表情瞬间凝固。
en_us: Amy's expression froze instantly.

source: 艾米盛了四碗黑不溜秋的扬州炒饭，一家四口坐在桌前，大眼瞪小眼。
en_us: Amy scooped up four bowls of black Yangzhou fried rice, and the family of four stared at one another at the table.

source: 艾米盯着她看了一会，认真的摇了摇头，“小姐姐你长得很美，就别想得太美了。”
en_us: Amy looked at her for a moment before shaking her head seriously. "Big Sister, you are pretty, so don't harbor too pretty thoughts."

source: 艾米看了一眼麦格，像是突然想起了什么，便乖巧的闭上了嘴巴，没有出声。
en_us: Amy threw a glance at Mag, and as if she suddenly remembered something, she shut her mouth obediently, and didn't make a sound.

source: 艾米看了看那蜗牛，摇摇头道：“你看它孤孤单单的多可怜啊，不如把它吃掉吧，我的肚子里可暖和了呢。”
en_us: Amy looked at that snail and shook her head, "Look at how lonely it is. Why don't I eat it? It's warm in my tummy."

source: 艾米看着亚伯罕，眼睛一亮，张嘴便要叫人。
en_us: Amy saw Abraham, and her eyes lit up immediately. She was about to call him.

source: 艾米看着关门回来的麦格，颇为的期待的问道：“父亲大人，我今天表现的好不好啊？”
en_us: Looking at Mag, who just returned after closing the door, Amy expectantly asked, "Father, did I perform well today?"

source: 艾米看着有些苦恼的麦格，提议道：“父亲大人，要不我们试试先把红色的油和黄瓜拌在一起吧。”
en_us: Amy looked at Mag, who was troubled, and suggested, "Father, why don't we try mixing the red oil and the cucumbers together first?"

source: 艾米看着红油抄手，脑海中跳出来一行备注。
en_us: A row of remarks popped up in Amy's mind when she looked at the Sichuan spicy wontons in red oil.

source: 艾米看着脑海中不断跳出来的生活体验值，讲的更起劲了。
en_us: Amy looked at the life experience points that kept popping up in her head and got even more excited at telling the stories.

source: 艾米眨了眨眼睛，改口道：“睡觉的时候做了一个梦，梦到了一个很好笑的人，说他自己是笑话大王，然后给我讲了很多笑话呢。”
en_us: Amy blinked and then changed her story, "I had a dream when I was sleeping. I dreamt of a very funny man. He said he was the king of jokes and then he told me many jokes."

source: 艾米眼睛一亮，接过篮子，先拿了一串糖葫芦咬了一口，然后有些含糊的感谢道：“谢谢埃菲姐姐。”
en_us: Amy's eyes lit up. She received the basket and bit onto the candied haw. After that, she thanked Eiffie with her mouth full, "Thank you Big Sister Eiffie."

source: 艾米眼睛一亮，期待的看着他道：“那可不可以带上我一起去啊？我也很能打的。”
en_us: Amy lit up her eyes and looked at him expectantly, "Can you bring me along too? I can fight very well too."

source: 艾米眼睛一亮，父亲大人开心，她也开心。
en_us: Amy lit up her eyes. She was happy as long as her father was happy.

source: 艾米碗里全是菜，埋头吃着，根本停不下来。
en_us: Food was piling up in Amy's bowl, and she could not stop eating.

source: 艾米秀气的眉毛微微上扬，眼睛亮晶晶的，像是发现了新大陆一般。
en_us: Amy's beautiful eyebrows rose and her eyes sparkled, as though she found no man's land.

source: 艾米端起可乐，仰头便是吨吨吨吨吨的灌了几大口。
en_us: Amy put the bottle to her mouth and gulped down huge mouthfuls of the drink.

source: 艾米笑容依旧，不过在诺亚的眼里却变成了小魔鬼的笑容。
en_us: Amy was still smiling brightly, but in Noah's eyes, that smile became the smile of a little devil.

source: 艾米笑眯眯的看着他说道：“吃了我的糖，你以后就是我的小弟了哦。”
en_us: Smiling, Amy said to him, "After eating my candy, you will be my little brother in the future."

source: 艾米翻身坐了起来，认真思考了一会，有些苦恼道：“可是，我不会做饭啊。”
en_us: Amy sat up and thought seriously for a while. After that, frustrated, she said, "But I don't know how to cook."

source: 艾米自己都惊呆了。
en_us: Amy had even shocked herself.

source: 艾米认真听着，过了好一会，才道：“所以呢？我要做什么？”
en_us: Amy listened very seriously. After a while, she said, "So? What do I have to do?"

source: 艾米认真的听着。
en_us: Amy listened seriously.

source: 艾米认真的听着，过了一会，提问道：“那有毒的蜗牛是不能吃的，没毒的蜗牛就是可以吃的，我把蜗牛先给丑小鸭吃，要是丑小鸭没事的话，那就是没有毒可以吃的蜗牛了，对吧？”
en_us: Amy listened carefully and after a while, she asked, "We can't eat the poisonous snails, but we can eat the non-poisonous ones. Then, I can let Ugly Duckling eat the snails first, if Ugly Duckling is fine, that means the snail is not poisonous and we can eat it, right?"

source: 艾米蹦跳着了来到门口，打开门。
en_us: Amy skipped to the door and opened it.
